[
    {
     "id": "1",
     "isFav": true,
     "imgSlider": "https://m.media-amazon.com/images/S/sonata-images-prod/ES_TVOD_GO_Uncharted_VOD/6f49478b-0809-4f0d-9597-e3afcae439e9._UR3000,600_SX1500_FMwebp_.jpeg",
     "imgUrl": "https://assets-prd.ignimgs.com/2022/01/13/uncharted-poster-full-1642086040683.jpg",
     "title": "Uncharted",
     "yearOfProd": "2022",
     "sinopsis": "Basada en una de las series de videojuegos más vendidas y aclamadas por la crítica de todos los tiempos, Uncharted presenta a un joven, astuto y carismático, Nathan Drake (Tom Holland) en su primera aventura como cazatesoros con su ingenioso compañero Victor Sully Sullivan (Mark Wahlberg). En una aventura de acción que se extiende por todo el mundo, ambos se embarcan en una peligrosa búsqueda de “el mayor tesoro nunca antes encontrado” al tiempo que rastrean las claves que les podrían conducir al hermano de Nathan, perdido hace ya mucho tiempo."
    },
    {
     "id": "2",
     "isFav": true,
     "imgSlider": "https://i2.wp.com/2.bp.blogspot.com/-oukQma8EAoc/TpZCLn9HPLI/AAAAAAAAACA/Nmq_VxILEfo/s1600/In%2BTime%2BFilm.jpg",
     "imgUrl": "https://i.ytimg.com/vi/_P8eFRCfno8/movieposter.jpg",
     "title": "In Time",
     "yearOfProd": "2011",
     "sinopsis": "Ambientada en una sociedad futura. El hallazgo de una fórmula contra el envejecimiento trae consigo no sólo superpoblación, sino también la transformación del tiempo en moneda de cambio que permite sufragar tanto lujos como necesidades. Los ricos pueden vivir para siempre, pero los demás tendrán que negociar cada minuto de vida, y los pobres mueren jóvenes. Tras conseguir, por casualidad, una inmensa cantidad de tiempo, Will (Timberlake), un joven obrero, será perseguido por unos policías corruptos, los guardianes del tiempo. En su huida, toma como rehén a una joven de familia adinerada"
    },
    {
     "id": "3",
     "isFav": true,
     "imgSlider": "https://i.blogs.es/15cee8/cartel-bajocero/1366_2000.jpeg",
     "imgUrl": "https://m.media-amazon.com/images/M/MV5BZmMzYjg4ZmQtMjc2Yy00ZWQ4LWE0M2ItMzNmYTFlMDJlNzUyXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg",
     "title": "Bajo Cero",
     "yearOfProd": "2021",
     "sinopsis": "En una fría noche cerrada de invierno, en mitad de una carretera despoblada, un furgón policial blindado es asaltado durante un traslado de presos. Alguien busca a alguien de su interior. Martín, el policía conductor del furgón, consigue atrincherarse dentro del cubículo blindado con los reclusos. Obligado a entenderse con sus enemigos naturales, Martín tratará de sobrevivir y cumplir con su deber en una larga noche de pesadilla en el que se pondrán a prueba incluso sus principios."
    },
    {
     "id": "4",
     "isFav": true,
     "imgSlider": "https://sm.ign.com/t/ign_za/articlepage/f/furious-7-/furious-7-review_7bes.1280.jpg",
     "imgUrl": "https://es.web.img3.acsta.net/pictures/15/03/09/12/33/510089.jpg",
     "title": "Fast&Furious7",
     "yearOfProd": "2015",
     "sinopsis": "Ha pasado un año desde que el equipo de Dominic Torreto y Brian pudiera regresar finalmente a Estados Unidos, tras ser indultados. Desean adaptarse a una vida en la legalidad, pero el entorno ya no es el mismo. Dom intenta acercarse a Letty, y Brian lucha para acostumbrarse a la vida en una urbanización con Mia y su hijo. Ninguno de ellos imagina que un frío asesino británico, entrenado para realizar operaciones secretas, se cruzará en sus vidas para convertirse en su mayor enemigo."
    },
    {
     "id": "5",
     "isFav": true,
     "imgSlider": "https://www.diariodevenusville.com/wp-content/uploads/2016/07/AHORA-ME-VES-2-critica.jpg",
     "imgUrl": "https://static.filmin.es/images/media/15662/1/poster_0_3_338x507.png",
     "title": "Ahora Me Ves 2",
     "yearOfProd": "2016",
     "sinopsis": "Un año después de despistar al FBI y conseguir la admiración del público con sus espectáculos mentales, los cuatro jinetes vuelven a la luz pública, pero un nuevo enemigo se propone arruinar su golpe más espectacular y peligroso hasta la fecha... Secuela de Now You See Me de 2013."
    },
    {
     "id": "6",
     "isFav": true,
     "imgSlider": "http://www.popcultureleftovers.com/wp-content/uploads/2020/03/SpenserConfidential-2.jpg",
     "imgUrl": "https://static.wixstatic.com/media/843f49_c0c89a5c286846db82c9eb2447e90f36~mv2.jpg/v1/fill/w_924,h_1280,al_c,q_85/843f49_c0c89a5c286846db82c9eb2447e90f36~mv2.jpg",
     "title": "Spenser Confidential",
     "yearOfProd": "2020",
     "sinopsis": "El exagente de policía Spenser (Mark Wahlberg) regresa a los bajos fondos de Boston cuando destapa la conspiración causante de un asesinato muy mediático. A pesar de las constantes amenazas, Spenser decide tomarse la justicia por su mano para demostrar que nadie está por encima de la ley."
    },
    {
     "id": "7",
     "isFav": false,
     "imgSlider": "https://flximg.flixlatinogo.com/7qwj6xqzq8kckgo0wo.jpg",
     "imgUrl": "https://m.media-amazon.com/images/M/MV5BMDU4YzE5NDgtMDAyNy00NjUwLTlmMjMtZGNhODRkMmE2MDMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_FMjpg_UX1000_.jpg",
     "title": "Torrente 4",
     "yearOfProd": "2011",
     "sinopsis": "Cuarta entrega de las aventuras del casposo policía José Luis Torrente. En esta ocasión encontramos a nuestro (anti)héroe en una situación delicada. Tras varios intentos fallidos de llevar una vida digna (como si eso fuese posible), decide aceptar un peligroso encargo que le hace un viejo conocido."
    },
    {
     "id": "8",
     "isFav": false,
     "imgSlider": "https://filasiete.com/wp-content/uploads/2009/11/celda211.jpg",
     "imgUrl": "https://clubcineperu.files.wordpress.com/2015/09/poster-celda-final.jpg",
     "title": "Celda 211",
     "yearOfProd": "2009",
     "sinopsis": "El día en que Juan (Alberto Ammann) empieza a trabajar en su nuevo destino como funcionario de prisiones, se ve atrapado en un motín carcelario. Decide entonces hacerse pasar por un preso más para salvar su vida y para poner fin a la revuelta, encabezada por el temible Malamadre (Luis Tosar). Lo que ignora es que el destino le ha preparado una encerrona."
    },
    {
     "title": "Incompatibles 2",
     "imgSlider": "https://juegodedragones.xyz/wp-content/uploads/2022/04/incompatibles-2-netflix-1030x579.jpg",
     "imgUrl": "https://es.web.img2.acsta.net/pictures/22/03/17/21/16/0281984.png",
     "yearOfProd": "2022",
     "id": "9",
     "isFav": false,
     "sinopsis": "Ousmane Diakité (Omar Sy) y François Monge (Laurent Lafitte) son dos policías de estilo, origen y trayectoria muy distintos. Hace muchos años trabajaron juntos, pero la vida los separó. Ahora, esta insólita pareja vuelve a coincidir en una nueva investigación que los lleva a los Alpes franceses. Lo que parecía una simple operación de narcotráfico se convierte en un caso criminal de dimensiones, peligros y situaciones cómicas inesperadas."
    },
    {
     "title": "Cars",
     "isFav": false,
     "imgSlider": "https://images.squarespace-cdn.com/content/v1/51cdafc4e4b09eb676a64e68/1618602532707-3OAII3QVHYKCW3KJ1HJU/cars_boast.jpg",
     "imgUrl": "https://m.media-amazon.com/images/I/71+mhWHnBdL._SL1500_.jpg",
     "yearOfProd": "2006",
     "id": "10",
     "sinopsis": "El aspirante a campeón de carreras Rayo McQueen parece que está a punto de conseguir el éxito, la fama y todo lo que había soñado, hasta que por error toma un desvío inesperado en la polvorienta y solitaria Ruta 66. Su actitud arrogante se desvanece cuando llega a una pequeña comunidad olvidada que le enseña las cosas importantes de la vida que había olvidado. "
    },
    {
     "title": "The Batman",
     "isFav": false,
     "imgSlider": "https://e00-marca.uecdn.es/assets/multimedia/imagenes/2022/02/27/16459875620726.jpg",
     "imgUrl": "https://s3.amazonaws.com/static.rogerebert.com/uploads/movie/movie_poster/the-batman-2022/large_batman_ver29.jpg",
     "yearOfProd": "2022",
     "id": "11",
     "sinopsis": "Después de dos años acechando por las calles de la ciudad como Batman (Robert Pattinson), e infundiendo miedo en las mentes perversas de los criminales, Bruce Wayne está sumido en las profundidades de las sombras de Gotham City. Este vigilante solitario cuenta con pocos aliados de confianza y eso le ha llevado a convertirse en la única encarnación de la venganza entre sus conciudadanos. Cuando un asesino apunta a la élite de Gotham con una serie de maquinaciones sádicas, un rastro de pistas crípticas lleva a Batman a realizar una investigación en el inframundo."
    },
    {
     "title": "6 en la sombra",
     "isFav": false,
     "imgSlider": "https://cinemagavia.es/wp-content/uploads/2019/12/6-en-la-sombra-2.jpg",
     "imgUrl": "https://www.ecartelera.com/carteles/14900/14926/002_m.jpg",
     "yearOfProd": "2019",
     "id": "12",
     "sinopsis": "Conoce a un nuevo tipo de héroe de acción. Seis agentes imposibles de rastrear, totalmente fuera de la red. Han enterrado su pasado para poder cambiar el futuro."
    }
   ]